# Libraries

In [56]:
# Import libraries
import numpy as np
import matplotlib.pyplot as plt
np.set_printoptions(precision=3, suppress=True)
import matplotlib.pyplot as plt
import pandas as pd
import math

# Orthogonality

## Data Files

In [80]:
# Normal order file
data48N = pd.read_csv("Normal48.csv")

In [83]:
# Reverse order file
data48R = pd.read_csv("Reverse48.csv")

In [84]:
# The first column record the rundom number, with "1","2","3","4","5" correspond to 
# the Normal measurement Order: "M1->M2", "M2-> M3", "M3-> M4", "M4-> M5", "M5-> M1",respectively;  
# and "6","7","8","9","10" 
# correspond to Reverse Order: "M1->M5", "M2->M1", "M3->M2", "M4->M3",  "M5->M4", respectively.

data48N.columns = ["meas", "Op1", "Op2"]
data48R.columns = ["meas", "Op1", "Op2"]

## Relabelling

In [85]:
# The second column record the photon counts of the first measurement, 
# which correspond to "Dark state" if the value <2.5; and "Bright state" the other case.

data48N.loc[data1["Op1"] <2.5,"Op1"] = 0 
data48N.loc[data1["Op1"] >=2.5,"Op1"] =1
data48R.loc[data2["Op1"] <2.5,"Op1"] = 0 
data48R.loc[data2["Op1"] >=2.5,"Op1"] =1

In [86]:
# The third column record the photon counts of the second measurement, 
# which correspond to "Dark state" if the value <8.5; and "Bright state" the other case.

data48N.loc[data1["Op2"] <8.5,"Op2"] = 0 
data48N.loc[data1["Op2"] >=8.5,"Op2"] =1
data48R.loc[data2["Op2"] <8.5,"Op2"] = 0 
data48R.loc[data2["Op2"] >=8.5,"Op2"] =1

In [87]:
data48N.head()

   meas  Op1  Op2
0     9    0    0
1     8    0    0
2     8    0    0
3     7    0    0
4     7    0    0

In [88]:
data48R.head()

   meas  Op1  Op2
0     9    0    0
1     8    0    0
2     8    0    0
3     7    0    0
4     7    0    0

In [66]:
data1["Product"] = data1["Op1"]*data1["Op2"]
data2["Product"] = data2["Op1"]*data2["Op2"]

In [67]:
data1

       meas  Op1  Op2  Product
0         1    1    0        0
1         1    1    0        0
2         1    0    1        0
3         3    0    1        0
4         1    1    0        0
...     ...  ...  ...      ...
83268     4    1    0        0
83269     2    1    0        0
83270     3    0    1        0
83271     3    0    1        0
83272     2    1    0        0

[83273 rows x 4 columns]

In [68]:
data2

       meas  Op1  Op2  Product
0         9    0    0        0
1         8    1    0        0
2         8    0    1        0
3         7    1    0        0
4         7    0    0        0
...     ...  ...  ...      ...
52760     9    0    1        0
52761    10    1    0        0
52762     9    0    1        0
52763     9    1    0        0
52764     6    0    1        0

[52765 rows x 4 columns]

In [69]:
data3 = data1.append(data2)

In [70]:
data3

       meas  Op1  Op2  Product
0         1    1    0        0
1         1    1    0        0
2         1    0    1        0
3         3    0    1        0
4         1    1    0        0
...     ...  ...  ...      ...
52760     9    0    1        0
52761    10    1    0        0
52762     9    0    1        0
52763     9    1    0        0
52764     6    0    1        0

[136038 rows x 4 columns]

In [71]:
data3.sum()

meas       671385
Op1         61258
Op2         61146
Product       848
dtype: int64

In [72]:
# Coarse-grained deviation from orthogonality
224.0/109998

0.002036400661830215

## Fine-Grained Orthogonality

In [73]:
# |P(11|pia,pib) -P(11|pib,pia)| <= max(P(11|pia,pib),P(11|pia,pib))
# Finding the worst case deviation from orthogonality, thus, corresponds to finding the max over all
# probabilities.
Or1 = data1.loc[data1["meas"]==1]
Or2 = data1.loc[data1["meas"]==2]
Or3 = data1.loc[data1["meas"]==3]
Or4 = data1.loc[data1["meas"]==4]
Or5 = data1.loc[data1["meas"]==5]

In [74]:
Or6 = data2.loc[data2["meas"]==6]
Or7 = data2.loc[data2["meas"]==7]
Or8 = data2.loc[data2["meas"]==8]
Or9 = data2.loc[data2["meas"]==9]
Or10 = data2.loc[data2["meas"]==10]
Or10.head()

    meas  Op1  Op2  Product
10    10    1    0        0
11    10    0    0        0
12    10    1    0        0
16    10    0    1        0
22    10    0    1        0

In [75]:
Or4.shape

(16668, 4)

In [76]:
List1= []
List1.append(Or1.sum()["Product"]/Or1.shape[0])
List1.append(Or2.sum()["Product"]/Or2.shape[0])
List1.append(Or3.sum()["Product"]/Or3.shape[0])
List1.append(Or4.sum()["Product"]/Or4.shape[0])
List1.append(Or5.sum()["Product"]/Or5.shape[0])
List1.append(Or6.sum()["Product"]/Or6.shape[0])
List1.append(Or7.sum()["Product"]/Or7.shape[0])
List1.append(Or8.sum()["Product"]/Or8.shape[0])
List1.append(Or9.sum()["Product"]/Or9.shape[0])
List1.append(Or10.sum()["Product"]/Or10.shape[0])
List1

[0.005516668643967256,
 0.007807338898564651,
 0.004268879268879269,
 0.004019678425725942,
 0.0033406219630709427,
 0.005245588936576061,
 0.007589412769186984,
 0.011034612845421107,
 0.007966616084977238,
 0.00906344410876133]

In [77]:
max(List1)

0.011034612845421107

# Violations

In [52]:
m1list = Or1["Op1"].tolist()
m1list = m1list + Or6["Op1"].tolist()
m2list = Or2["Op1"].tolist()
m2list = m2list + Or7["Op1"].tolist()
m3list = Or3["Op1"].tolist()
m3list = m3list + Or8["Op1"].tolist()
m4list = Or4["Op1"].tolist()
m4list = m4list + Or9["Op1"].tolist()
m5list = Or5["Op1"].tolist()
m5list = m5list + Or10["Op1"].tolist()
mean_list = [np.mean(m1list),np.mean(m2list),np.mean(m3list),np.mean(m4list),np.mean(m5list)]
sum(mean_list)

2.2515379560299795

In [53]:
np.sqrt(5)

2.23606797749979

In [54]:
slist = [np.std(m1list)/np.sqrt(len(m1list)),np.std(m2list)/np.sqrt(len(m2list)),np.std(m3list)/np.sqrt(len(m3list)),np.std(m4list)/np.sqrt(len(m4list)),np.std(m5list)/np.sqrt(len(m5list))]
val = np.sqrt(slist[0]*slist[0]+slist[1]*slist[1]+slist[2]*slist[2]+slist[3]*slist[3]+slist[4]*slist[4] )
val

0.006744466802361366

In [55]:
# https://en.wikipedia.org/wiki/Standard_error
#https://en.wikipedia.org/wiki/1.96
2.249495397736814 - 1.96*0.00861973744464191

2.232600712345316